tests/DummyData/Receita.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:tem="http://ws.receitas.food.com.br/">
  <soapenv:Header/>
  <soapenv:Body>
    <tem:COM_RECEITA>
      <tem:receita>
        <receita>
          <titulo>Pão simples</titulo>
          <ingredientes>
            <ingrediente>Farinha de Trigo</ingrediente>
            <ingrediente>Fermento</ingrediente>
            <ingrediente>Água</ingrediente>
            <ingrediente>Sal</ingrediente>
          </ingredientes>
          <instrucoes>
            <passo>Misture todos os ingredientes, e dissolva bem.</passo>
            <passo>Cubra com um pano e deixe por uma hora em um local morno.</passo>
            <passo>Misture novamente, coloque numa bandeja e asse num forno.</passo>
          </instrucoes>
        </receita>
      </tem:receita>
    </tem:COM_RECEITA>
  </soapenv:Body>
</soapenv:Envelope>
